ГрумингСалон/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРожденияКлиента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Питомцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПитомца</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПитомцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПородаПитомца</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПородыПитомцев</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КличкаПитомца</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРожденияПитомца</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГрумингСалон/Enums/ТипыКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГрумингСалон/Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 УстановитьВидимость();
КонецПроцедуры 
&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагента.Клиент") Тогда
		Элементы.ДатаРожденияКлиента.Видимость = Истина;
		Элементы.Источник.Видимость = Истина;
		Элементы.Договор.Видимость = Ложь;
		Элементы.Питомцы.Видимость = Истина;
		Элементы.Пол.Видимость = Истина;
		Элементы.Наименование.Заголовок = "Ф.И.О клиента";
	Иначе
	    Элементы.ДатаРожденияКлиента.Видимость = Ложь;
		Элементы.Источник.Видимость = Ложь;
		Элементы.Договор.Видимость = Истина;
		Элементы.Питомцы.Видимость = Ложь;
		Элементы.Пол.Видимость = Ложь;
		Элементы.Наименование.Заголовок = "Наименование";
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	 УстановитьВидимость();
КонецПроцедуры
